XML/Public/PMSQ01/request_pre/2022年3月1日/body_PMSQ01_request_pre_20220301203640.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
       <MBS>
  <pub>
    <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>txbPMSQ01_20220301203639</SRCBATCHNO>
    <TRANSCODE>PMSQ01</TRANSCODE>
    <TRANSDATETIME>2020-11-06 08:44:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
    <head>
      <ALLAMOUNT>396</ALLAMOUNT>
      <ALLCOUNT>1</ALLCOUNT>
    </head>
    <list>
        <detail>
        <SRCSERIALNO>testPMSQ01_20220301203639</SRCSERIALNO>
        <SRCNOTECODE></SRCNOTECODE>
        <ORGCODE>001004</ORGCODE>
        <APPLYORGCODE>001004</APPLYORGCODE>
        <PAYDATE>2020-11-06</PAYDATE>
        <PAYTYPECODE>103</PAYTYPECODE>
        <SETTLEMENTMODECODE>101</SETTLEMENTMODECODE>
        <OURORGCODE>001004</OURORGCODE>
        <OURBANKACCOUNTNUMBER>10000001</OURBANKACCOUNTNUMBER>
        <OURCURCODE>CNY</OURCURCODE>
        <OURAMOUNT>396</OURAMOUNT>
        <ISURGENT>0</ISURGENT>
        <OPPBANKACCOUNTNAME>秦燕</OPPBANKACCOUNTNAME>
        <OPPBANKACCOUNTNUMBER>4213491430102000</OPPBANKACCOUNTNUMBER>
        <OPPOBJECTNAME>秦燕</OPPOBJECTNAME>
        <OPPOBJECTCODE>00001</OPPOBJECTCODE>
        <OPPBANKLOCATIONCODE>402821006102</OPPBANKLOCATIONCODE>
        <OPPBANKLOCATIONS>甘肃榆中农村合作银行龙泉分理处</OPPBANKLOCATIONS>
        <OPPDIRECTCURCODE>CNY</OPPDIRECTCURCODE>
        <OPPPRIVATEFLAG>1</OPPPRIVATEFLAG>
        <PURPOSE>天使投资</PURPOSE>
        <EXTFIELD1>啦啦啦啦啦</EXTFIELD1>	
        <PROJECTITEMCODE>s01,s02</PROJECTITEMCODE>
        <CONTRACTNUMBER>HT01</CONTRACTNUMBER>
        <FINVOUCHERCODE>PZ01</FINVOUCHERCODE>
        <CASHFLOWITEMCODE>ss2</CASHFLOWITEMCODE>
      </detail> 
    </list>
  </req>
</MBS>
         ]]>
         </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>